
## :white_check_mark: Apply Succeeded (user-list-search-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/63491)



<pre><code>Apply complete! Resources: 1 added, 7 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=eb3023edbeeebdfc480fc7b0d501bff94c63f5bf]
data.terraform_remote_state.incident_management: Read complete after 1s
data.aws_ssm_parameter.pagerduty_token: Reading...
aws_cloudwatch_log_group.elasticsearch_slow_query: Refreshing state... [id=/aws/aes/domains/userlistsearch-prod/slowquery]
data.aws_iam_policy.aws_xray_write_only_access: Reading...
aws_codedeploy_app.lambda_item_update_backfill: Refreshing state... [id=f6bce757-c082-4468-88ce-dc4eb2253d79:UserListSearch-Prod-ItemUpdateBackfill]
aws_cloudwatch_log_group.xray: Refreshing state... [id=/ecs/UserListSearch/Prod/xray]
aws_codedeploy_app.ecs_codedeploy_app: Refreshing state... [id=65b6b693-a473-4baf-8fff-6e98365830e0:UserListSearch-Prod]
aws_cloudwatch_log_group.queue_users_ecs: Refreshing state... [id=/ecs/UserListSearch/Prod/QueueUsers/node]
aws_cloudwatch_log_group.elasticsearch_slow_index: Refreshing state... [id=/aws/aes/domains/userlistsearch-prod/slowindex]
aws_sqs_queue.user_list_events_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListEvents-Deadletter]
aws_sqs_queue.user_events_sns_topic_dlq: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-SNS-Topic-DLQ]
aws_cloudwatch_log_group.user_list_events_sqs_processor: Refreshing state... [id=/aws/lambda/UserListSearch-Prod-EventHandler]
aws_cloudwatch_log_group.item_delete_sqs_processor: Refreshing state... [id=/aws/lambda/UserListSearch-Prod-ItemDelete]
aws_cloudwatch_log_group.item_update_backfill_sqs_processor: Refreshing state... [id=/aws/lambda/UserListSearch-Prod-ItemUpdateBackfill]
aws_cloudwatch_log_group.apollo_ecs: Refreshing state... [id=/ecs/UserListSearch/Prod/Apollo/node]
data.aws_sns_topic.backend-deploy-topic: Reading...
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/UserListSearch-Prod]
data.aws_ssm_parameter.pagerduty_token: Read complete after 0s [id=/Shared/PAGERDUTY_TOKEN]
data.aws_iam_policy.aws_xray_write_only_access: Read complete after 0s [id=arn:aws:iam::aws:policy/AWSXrayWriteOnlyAccess]
data.aws_route53_zone.main_zone: Reading...
aws_codedeploy_app.lambda_user_list_import_backfill: Refreshing state... [id=ba72983d-5545-411b-92af-4d50f278d96b:UserListSearch-Prod-UserListImportBackfill]
aws_sqs_queue.user_items_update_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsUpdate-Deadletter]
aws_cloudwatch_log_group.item_update_sqs_processor: Refreshing state... [id=/aws/lambda/UserListSearch-Prod-ItemUpdate]
aws_cloudwatch_log_group.elasticsearch_error: Refreshing state... [id=/aws/aes/domains/userlistsearch-prod/error]
aws_cloudwatch_log_group.user_list_import_backfill_sqs_processor: Refreshing state... [id=/aws/lambda/UserListSearch-Prod-UserListImportBackfill]
aws_codedeploy_app.lambda_item_update: Refreshing state... [id=16171226-4240-4871-90c3-40b5fc6b80f7:UserListSearch-Prod-ItemUpdate]
data.aws_ssm_parameter.sentry_dsn: Reading...
aws_codedeploy_app.lambda_user_list_import: Refreshing state... [id=4c2ef02d-0777-4782-8c2b-c9e4b2bb3da9:UserListSearch-Prod-UserListImport]
aws_ecr_repository.ecr_repo: Refreshing state... [id=userlistsearch-prod]
data.aws_sns_topic.backend-deploy-topic: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
aws_s3_bucket.synthetics_logs: Refreshing state... [id=userlistsearch-prod-syntheticlogs]
data.aws_ssm_parameter.sentry_dsn: Read complete after 0s [id=/UserListSearch/Prod/SENTRY_DSN]
aws_s3_bucket.lambda_unified_events_consumer_code_bucket: Refreshing state... [id=pocket-userlistsearch-prod-kinesis-consumer]
data.aws_kms_alias.secrets_manager: Reading...
data.aws_iam_policy_document.ecs_task_assume: Reading...
aws_codedeploy_app.lambda_user_list_events: Refreshing state... [id=6340a9b8-5f10-4cbb-a811-accf461965ad:UserListSearch-Prod-EventHandler]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
aws_sqs_queue.user_items_delete_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsDelete-Deadletter]
data.aws_kms_alias.secrets_manager: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
aws_sqs_queue.user_items_update_backfill_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsUpdateBackfill-Deadletter]
data.aws_iam_policy_document.codedeploy_assume_role: Reading...
data.aws_iam_policy_document.elasticsearch_log_publishing: Reading...
data.aws_iam_policy_document.codedeploy_assume_role: Read complete after 0s [id=4250039221]
data.aws_iam_policy_document.elasticsearch_log_publishing: Read complete after 0s [id=2597252832]
aws_acm_certificate.root_cert: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/c1098198-6ea9-44cc-abf6-9d4ccb0b9914]
aws_codedeploy_app.lambda_unified_events_consumer: Refreshing state... [id=5dd2b608-4987-4821-981c-872e051a168b:UserListSearch-Prod-UnifiedEventsConsumer]
data.aws_kinesis_stream.unified: Reading...
aws_cloudwatch_log_group.unified_events_consumer: Refreshing state... [id=/aws/lambda/UserListSearch-Prod-UnifiedEventsConsumer]
aws_route53_zone.hosted_zone: Refreshing state... [id=Z04020431ZEYOSMR1D5WC]
aws_cloudwatch_log_group.user_list_import_sqs_processor: Refreshing state... [id=/aws/lambda/UserListSearch-Prod-UserListImport]
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_route53_zone.main_zone: Read complete after 0s [id=Z2BHWTOWFVNW3M]
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_iam_policy_document.lambda_assume: Reading...
aws_codedeploy_app.lambda_item_delete: Refreshing state... [id=7299050a-586b-463b-b741-a10bbe25a11c:UserListSearch-Prod-ItemDelete]
data.aws_ssm_parameter.vpc: Reading...
data.aws_iam_policy_document.lambda_assume: Read complete after 0s [id=2690255455]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=996905175585]
module.emergency_response.aws_sns_topic.topics["non-critical"]: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:UserListSearch-Prod-SNS-Non-Critical]
module.emergency_response.aws_sns_topic.topics["critical"]: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:UserListSearch-Prod-SNS-Critical]
data.aws_kinesis_stream.unified: Read complete after 0s [id=arn:aws:kinesis:us-east-1:996905175585:stream/unified_event]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_sqs_queue.user_list_import_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImport-Deadletter]
aws_sqs_queue.user_list_import_backfill_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImportBackfill-Deadletter]
data.aws_ssm_parameter.vpc: Read complete after 0s [id=/Shared/Vpc]
aws_sqs_queue.user_list_events: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListEvents]
aws_iam_role.lambda_codedeploy_role: Refreshing state... [id=UserListSearch-Prod-LambdaCodeDeployRole]
aws_iam_role.ecs_codedeploy_role: Refreshing state... [id=UserListSearch-Prod-ECSCodeDeployRole]
aws_iam_role.ecs_execution_role: Refreshing state... [id=UserListSearch-Prod-TaskExecutionRole]
aws_sqs_queue.user_items_delete: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsDelete]
aws_iam_role.ecs_task_role: Refreshing state... [id=UserListSearch-Prod-TaskRole]
aws_sqs_queue.user_items_update: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsUpdate]
aws_cloudwatch_log_resource_policy.elasticsearch_log_publishing: Refreshing state... [id=UserListSearch-Prod-AesLogPublish]
aws_sqs_queue.user_items_update_backfill: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsUpdateBackfill]
aws_ecr_lifecycle_policy.old_images_policy: Refreshing state... [id=userlistsearch-prod]
aws_iam_role.item_update_backfill_lambda_role: Refreshing state... [id=UserListSearch-Prod-ItemUpdateBackfillLambdaExecutionRole]
aws_iam_role.lambda_role: Refreshing state... [id=UserListSearch-Prod-LambdaExecutionRole]
aws_iam_role.user_list_events_lambda_role: Refreshing state... [id=UserListSearch-Prod-UserListEventsLambdaExecutionRole]
aws_iam_role.item_delete_lambda_role: Refreshing state... [id=UserListSearch-Prod-ItemDeleteLambdaExecutionRole]
aws_iam_role.item_update_lambda_role: Refreshing state... [id=UserListSearch-Prod-ItemUpdateLambdaExecutionRole]
aws_iam_role.user_list_import_lambda_role: Refreshing state... [id=UserListSearch-Prod-UserListImportLambdaExecutionRole]
aws_iam_role.user_list_import_backfill_lambda_role: Refreshing state... [id=UserListSearch-Prod-UserListImportBackfillLambdaExecutionRole]
aws_iam_role.syntethics: Refreshing state... [id=UserListSearch-Prod-CloudWatchSyntheticsRole]
aws_codestarnotifications_notification_rule.lambda_user_list_events_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/f7f916af7b816e2b4d4d0d3edc0730bf00fb50cc]
aws_codestarnotifications_notification_rule.lambda_user_list_import_backfill_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/d01f01c7e56fb475e8b088edc8542c7aeadc3d4d]
data.aws_iam_policy_document.ecs_task_execution_role_policy: Reading...
data.aws_iam_policy_document.ecs_task_execution_role_policy: Read complete after 0s [id=498924790]
aws_codestarnotifications_notification_rule.lambda_item_update_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/4ef84f8fb4ce1560d5b46d4fe3447c2bf5f23758]
aws_codestarnotifications_notification_rule.lambda_user_list_import_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/42ce552b35cd71615f33aad94863869f3a0dd2b2]
aws_codestarnotifications_notification_rule.lambda_item_update_backfill_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/13d1feb6d1c384afda963c112196e1c2774a316f]
aws_codestarnotifications_notification_rule.apollo_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/5789bde4cd9a729fb9277fe0c0b22b8363d7b005]
data.aws_vpc.vpc: Reading...
aws_codestarnotifications_notification_rule.lambda_unified_events_consumer_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/3279b5719fa1ea8fc929dea926bff3620bbf2bbd]
aws_sqs_queue.user_list_import: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImport]
aws_sqs_queue.user_list_import_backfill: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImportBackfill]
aws_route53_record.root_route53_record: Refreshing state... [id=Z04020431ZEYOSMR1D5WC__3d055461979bee1fc3a98658e119f188.user-list-search.readitlater.com._CNAME]
aws_route53_record.hosted_zone_ns: Refreshing state... [id=Z2BHWTOWFVNW3M_user-list-search.readitlater.com._NS]
aws_codestarnotifications_notification_rule.lambda_item_delete_notifications: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/8701007e6351963ae330dc2921b3d4c0f0c7c03a]
data.aws_iam_policy_document.user_list_events_lambda_execution_policy: Reading...
data.aws_iam_policy_document.syntethics: Reading...
data.aws_iam_policy_document.user_list_events_lambda_execution_policy: Read complete after 0s [id=2306242676]
aws_s3_bucket_acl.lambda_unified_events_consumer_code_bucket: Refreshing state... [id=pocket-userlistsearch-prod-kinesis-consumer,private]
data.aws_iam_policy_document.syntethics: Read complete after 0s [id=2222275188]
aws_s3_bucket_public_access_block.lambda_unified_events_consumer_code_bucket: Refreshing state... [id=pocket-userlistsearch-prod-kinesis-consumer]
data.aws_iam_policy_document.item_update_lambda_execution_policy: Reading...
aws_iam_role_policy_attachment.ecs_codedeploy_role: Refreshing state... [id=UserListSearch-Prod-ECSCodeDeployRole-20200721223852275900000003]
data.aws_iam_policy_document.item_delete_lambda_execution_policy: Reading...
data.aws_iam_policy_document.item_delete_lambda_execution_policy: Read complete after 0s [id=2967773805]
data.aws_iam_policy_document.item_update_lambda_execution_policy: Read complete after 0s [id=2708237507]
aws_iam_role_policy_attachment.ecs_execution_role_xray_write: Refreshing state... [id=UserListSearch-Prod-TaskExecutionRole-20200731183319076200000001]
aws_iam_role_policy_attachment.ecs_task_execution_default_attachment: Refreshing state... [id=UserListSearch-Prod-TaskExecutionRole-20200721223852398300000004]
aws_codedeploy_deployment_group.lambda_item_update: Refreshing state... [id=f3de2d06-abdd-4622-8c01-f45be689047b]
aws_codedeploy_deployment_group.lambda_item_update_backfill: Refreshing state... [id=ff04eb25-0f03-40f0-b1ea-c570347f467a]
aws_codedeploy_deployment_group.lambda_user_list_import_backfill: Refreshing state... [id=6af728d3-c2c5-4f26-bddf-790a4f414566]
aws_codedeploy_deployment_group.lambda_item_delete: Refreshing state... [id=7c342e7a-68bd-4b90-adf9-35b6000aa55f]
aws_codedeploy_deployment_group.lambda_unified_events_consumer: Refreshing state... [id=09a4ba63-459f-44ed-af24-007f0d37e196]
aws_codedeploy_deployment_group.lambda_user_list_import: Refreshing state... [id=e5e02204-adef-4f40-ae4c-34b90a68eebc]
aws_codedeploy_deployment_group.lambda_user_list_events: Refreshing state... [id=a27ab323-ee49-42b1-aa66-131aa3c0a12c]
data.aws_vpc.vpc: Read complete after 0s
aws_iam_role_policy_attachment.lambda_codedeploy_role: Refreshing state... [id=UserListSearch-Prod-LambdaCodeDeployRole-arn:aws:iam::aws:policy/service-role/AWSCodeDeployRoleForLambda]
aws_iam_role_policy_attachment.ecs_task_role_xray_write: Refreshing state... [id=UserListSearch-Prod-TaskRole-20231114152643708700000001]
aws_iam_role_policy_attachment.user_list_events_lambda_role_xray_write: Refreshing state... [id=UserListSearch-Prod-UserListEventsLambdaExecutionRole-20220513192359455800000001]
data.aws_iam_policy_document.user_events_sqs_policy_document: Reading...
data.aws_iam_policy_document.user_events_sns_topic_dlq_policy_document: Reading...
data.aws_iam_policy_document.user_events_sqs_policy_document: Read complete after 0s [id=3232374281]
data.aws_iam_policy_document.user_events_sns_topic_dlq_policy_document: Read complete after 0s [id=622168206]
aws_iam_role_policy_attachment.item_update_backfill_lambda_role_xray_write: Refreshing state... [id=UserListSearch-Prod-ItemUpdateBackfillLambdaExecutionRole-20200731183319105200000004]
aws_sns_topic_subscription.user_events_sns_topic_subscription: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:7d361d54-6087-4b39-815b-db0b0d7aedae]
aws_iam_policy.ecs_task_execution_role_policy: Refreshing state... [id=arn:aws:iam::996905175585:policy/UserListSearch-Prod-TaskExecutionRolePolicy]
aws_iam_role_policy_attachment.item_update_lambda_role_xray_write: Refreshing state... [id=UserListSearch-Prod-ItemUpdateLambdaExecutionRole-20200731183319119800000005]
aws_iam_role_policy_attachment.lambda_role_xray_write: Refreshing state... [id=UserListSearch-Prod-LambdaExecutionRole-20200731183319093500000003]
aws_iam_role_policy_attachment.item_delete_lambda_role_xray_write: Refreshing state... [id=UserListSearch-Prod-ItemDeleteLambdaExecutionRole-20200820163545472500000001]
aws_iam_role_policy_attachment.user_list_import_lambda_role_xray_write: Refreshing state... [id=UserListSearch-Prod-UserListImportLambdaExecutionRole-20200731183319087300000002]
aws_iam_role_policy_attachment.user_list_import_backfill_lambda_role_xray_write: Refreshing state... [id=UserListSearch-Prod-UserListImportBackfillLambdaExecutionRole-20200731183319391200000006]
data.aws_iam_policy_document.user_list_import_lambda_execution_policy: Reading...
module.emergency_response.pagerduty_service.pagerduty["critical"]: Refreshing state... [id=PN5UE69]
data.aws_iam_policy_document.lambda_execution_policy: Reading...
module.emergency_response.pagerduty_service.pagerduty["non-critical"]: Refreshing state... [id=P6W6DTJ]
data.aws_iam_policy_document.item_update_backfill_lambda_execution_policy: Reading...
data.aws_iam_policy_document.user_list_import_lambda_execution_policy: Read complete after 1s [id=3065182728]
data.aws_iam_policy_document.lambda_execution_policy: Read complete after 0s [id=1371518489]
aws_iam_role_policy.user_list_events_lambda_execution_policy: Refreshing state... [id=UserListSearch-Prod-UserListEventsLambdaExecutionRole:UserListSearch-Prod-UserListEventsAccessPolicy]
data.aws_iam_policy_document.ecs_task_role_policy: Reading...
data.aws_iam_policy_document.item_update_backfill_lambda_execution_policy: Read complete after 0s [id=2321925309]
data.pagerduty_vendor.cloudwatch: Reading...
data.aws_iam_policy_document.ecs_task_role_policy: Read complete after 0s [id=3306957108]
data.aws_iam_policy_document.user_list_import_backfill_lambda_execution_policy: Reading...
aws_iam_role_policy.item_delete_lambda_execution_policy: Refreshing state... [id=UserListSearch-Prod-ItemDeleteLambdaExecutionRole:UserListSearch-Prod-ItemDeleteAccessPolicy]
aws_iam_role_policy.syntethics: Refreshing state... [id=UserListSearch-Prod-CloudWatchSyntheticsRole:UserListSearch-Prod-CloudWatchSyntheticsPolicy]
data.aws_iam_policy_document.user_list_import_backfill_lambda_execution_policy: Read complete after 0s [id=2321925309]
aws_iam_role_policy.item_update_lambda_execution_policy: Refreshing state... [id=UserListSearch-Prod-ItemUpdateLambdaExecutionRole:UserListSearch-Prod-ItemUpdateAccessPolicy]
aws_acm_certificate_validation.root_cert_validation: Refreshing state... [id=2022-05-24 04:15:27 +0000 UTC]
aws_security_group.es: Refreshing state... [id=sg-0ae11a91c013981c8]
aws_security_group.alb_security_group: Refreshing state... [id=sg-0730cedf10206a5df]
aws_sqs_queue_policy.user_events_sns_topic_dlq_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-SNS-Topic-DLQ]
aws_sqs_queue_policy.user_events_sqs_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListEvents]
aws_iam_role_policy_attachment.ecs_task_execution_custom_attachment: Refreshing state... [id=UserListSearch-Prod-TaskExecutionRole-20200721223852404000000005]
aws_iam_role_policy.user_list_import_lambda_execution_policy: Refreshing state... [id=UserListSearch-Prod-UserListImportLambdaExecutionRole:UserListSearch-Prod-UserListImportAccessPolicy]
aws_lambda_function.unified_events_consumer: Refreshing state... [id=UserListSearch-Prod-UnifiedEventsConsumer]
aws_iam_role_policy.lambda_execution_policy: Refreshing state... [id=UserListSearch-Prod-LambdaExecutionRole:UserListSearch-Prod-KinesisEventAccessPolicy]
aws_iam_policy.ecs_task_role_policy: Refreshing state... [id=arn:aws:iam::996905175585:policy/UserListSearch-Prod-TaskRolePolicy]
aws_iam_role_policy.item_update_backfill_lambda_execution_policy: Refreshing state... [id=UserListSearch-Prod-ItemUpdateBackfillLambdaExecutionRole:UserListSearch-Prod-ItemUpdateBackfillAccessPolicy]
aws_iam_role_policy.user_list_import_backfill_lambda_execution_policy: Refreshing state... [id=UserListSearch-Prod-UserListImportBackfillLambdaExecutionRole:UserListSearch-Prod-UserListImportBackfillAccessPolicy]
aws_elasticsearch_domain.user_search[0]: Refreshing state... [id=arn:aws:es:us-east-1:996905175585:domain/userlistsearch-prod-v2]
aws_security_group.ecs_security_group: Refreshing state... [id=sg-0bab147168eae0b8d]
aws_iam_role_policy_attachment.ecs_task_custom_attachment: Refreshing state... [id=UserListSearch-Prod-TaskRole-20200722031705293400000001]
aws_alb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/ULS20200721223853436700000006/9d9356738ef523be]
aws_lambda_alias.unified_events_consumer: Refreshing state... [id=arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UnifiedEventsConsumer:DEPLOYED]
aws_lambda_function.item_update_backfill_sqs_processor: Refreshing state... [id=UserListSearch-Prod-ItemUpdateBackfill]
aws_lambda_function.user_list_import_backfill_sqs_processor: Refreshing state... [id=UserListSearch-Prod-UserListImportBackfill]
aws_lambda_function.item_update_sqs_processor: Refreshing state... [id=UserListSearch-Prod-ItemUpdate]
aws_lambda_function.user_list_import_sqs_processor: Refreshing state... [id=UserListSearch-Prod-UserListImport]
aws_lambda_function.user_list_events_sqs_processor: Refreshing state... [id=UserListSearch-Prod-EventHandler]
data.pagerduty_vendor.cloudwatch: Read complete after 0s [id=PZQ6AUS]
aws_lambda_function.item_delete_sqs_processor: Refreshing state... [id=UserListSearch-Prod-ItemDelete]
aws_lambda_event_source_mapping.kinesis_consumer: Refreshing state... [id=718a28d6-da38-4ed7-aed5-23fb28f64d5c]
aws_route53_record.root_A_record: Refreshing state... [id=Z04020431ZEYOSMR1D5WC__A_UserListSearch-Prod]
aws_alb_target_group.alb_target: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/UserListSearch-Prod-Blue/01def4903198c783]
aws_alb_target_group.alb_target_green: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/UserListSearch-Prod-Green/ad83c6d91d701e55]
aws_alb_listener.listener_http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/ULS20200721223853436700000006/9d9356738ef523be/d536ab3991a9db28]
aws_lambda_alias.user_list_import_sqs_processor: Refreshing state... [id=arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UserListImport:DEPLOYED]
aws_lambda_alias.item_update_backfill_sqs_processor: Refreshing state... [id=arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemUpdateBackfill:DEPLOYED]
aws_lambda_alias.item_update_sqs_processor: Refreshing state... [id=arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemUpdate:DEPLOYED]
aws_lambda_alias.user_list_import_backfill_sqs_processor: Refreshing state... [id=arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UserListImportBackfill:DEPLOYED]
module.emergency_response.pagerduty_service_integration.integrations[0]: Refreshing state... [id=P2JI6OA]
aws_lambda_event_source_mapping.user_list_import_sqs: Refreshing state... [id=4b7e4278-ed69-48bb-b27a-24d68ed0f2db]
aws_lambda_event_source_mapping.item_update_backfill_sqs: Refreshing state... [id=19d97191-7cda-47a7-b9ae-b583097b4d04]
module.emergency_response.pagerduty_service_integration.integrations[1]: Refreshing state... [id=PLG46YH]
aws_lambda_alias.user_list_events_sqs_processor: Refreshing state... [id=arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-EventHandler:DEPLOYED]
aws_lambda_alias.item_delete_sqs_processor: Refreshing state... [id=arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemDelete:DEPLOYED]
aws_lambda_event_source_mapping.item_update_sqs: Refreshing state... [id=a48eecb7-c20a-4f64-b8ed-f09783354589]
aws_lambda_event_source_mapping.user_list_import_backfill_sqs: Refreshing state... [id=861a3086-4094-4a2e-bbc4-a86cb6bdb110]
aws_lambda_event_source_mapping.user_list_events_sqs: Refreshing state... [id=06075a57-d8f8-4e37-ac0a-b13ff54dd3eb]
aws_lambda_event_source_mapping.item_delete_sqs: Refreshing state... [id=37c25306-552b-4e38-8032-a7bbee224b88]
aws_alb_listener.listener_https: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/ULS20200721223853436700000006/9d9356738ef523be/0234a26845a67886]
aws_ecs_task_definition.apollo: Refreshing state... [id=UserListSearch-Prod-Apollo]
module.emergency_response.aws_sns_topic_subscription.pagerduty_subscriptions[0]: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:UserListSearch-Prod-SNS-Critical:427e85c4-2b83-4b83-acc3-e87fd87ea5b3]
module.emergency_response.aws_sns_topic_subscription.pagerduty_subscriptions[1]: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:UserListSearch-Prod-SNS-Non-Critical:311be603-b33d-4cc3-8930-b5ecd89f14d7]
aws_ecs_task_definition.queue_users: Refreshing state... [id=UserListSearch-Prod-QueueUsers]
local_file.appspec: Refreshing state... [id=ee04b4dfee43272d07c57b60e0778d56b876c41a]
aws_ecs_service.apollo: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:service/UserListSearch-Prod/Apollo]
aws_codedeploy_deployment_group.apollo_codedeploy_group: Refreshing state... [id=8640b7d6-7b30-4b0a-97ad-aa55618cff9f]
module.dashboard_alarm.aws_cloudwatch_metric_alarm.metric_alarms["elasticsearch_write_block"]: Refreshing state... [id=UserListSearch-Prod-ElasticSearchWriteBlockedCritical]
module.dashboard_alarm.aws_cloudwatch_metric_alarm.metric_alarms["list_item_import_errors"]: Refreshing state... [id=UserListSearch-Prod-UserListImportErrors]
module.dashboard_alarm.aws_cloudwatch_metric_alarm.metric_alarms["alb_target_error_rate_critical"]: Refreshing state... [id=UserListSearch-Prod-ApolloALBTargetErrorRateCritical]
module.dashboard_alarm.aws_cloudwatch_metric_alarm.metric_alarms["event_consumer_lambda_errors"]: Refreshing state... [id=UserListSearch-Prod-EventConsumerLambdaErrors]
module.dashboard_alarm.aws_cloudwatch_metric_alarm.metric_alarms["list_item_update_errors"]: Refreshing state... [id=UserListSearch-Prod-UserItemUpdateErrors]
module.dashboard_alarm.aws_cloudwatch_metric_alarm.metric_alarms["user_item_list_update_processing"]: Refreshing state... [id=UserListSearch-Prod-UserItemListUpdateProcessingRate]
module.dashboard_alarm.aws_cloudwatch_metric_alarm.metric_alarms["user_item_list_import_processing"]: Refreshing state... [id=UserListSearch-Prod-UserItemImportProcessingRate]
module.dashboard_alarm.aws_cloudwatch_dashboard.dashboard["sla"]: Refreshing state... [id=UserListSearch-Prod]
null_resource.apollo_update-task-definition: Refreshing state... [id=7817611888103719080]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.item_delete_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "item_delete_sqs_processor" {
        id                             = "UserListSearch-Prod-ItemDelete"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemDelete:223" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemDelete:223/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "223" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "BACKFILL"                  = "false" -> null
              + "SQS_USER_ITEMS_DELETE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsDelete"
              + "SQS_USER_ITEMS_UPDATE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsUpdate"
              + "SQS_USER_LIST_IMPORT_URL"  = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImport"
                # (3 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.item_update_backfill_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "item_update_backfill_sqs_processor" {
        id                             = "UserListSearch-Prod-ItemUpdateBackfill"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemUpdateBackfill:312" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemUpdateBackfill:312/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "312" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "SQS_USER_ITEMS_DELETE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsDelete"
              + "SQS_USER_ITEMS_UPDATE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsUpdate"
              + "SQS_USER_LIST_IMPORT_URL"  = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImport"
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.item_update_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "item_update_sqs_processor" {
        id                             = "UserListSearch-Prod-ItemUpdate"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemUpdate:317" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemUpdate:317/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "317" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "BACKFILL"                  = "false" -> null
              + "SQS_USER_ITEMS_DELETE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsDelete"
              + "SQS_USER_ITEMS_UPDATE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsUpdate"
              + "SQS_USER_LIST_IMPORT_URL"  = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImport"
                # (3 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.unified_events_consumer will be updated in-place
  ~ resource "aws_lambda_function" "unified_events_consumer" {
        id                             = "UserListSearch-Prod-UnifiedEventsConsumer"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UnifiedEventsConsumer:352" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UnifiedEventsConsumer:352/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "352" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "BACKFILL"                  = "false" -> null
              + "SQS_USER_ITEMS_DELETE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsDelete"
              + "SQS_USER_ITEMS_UPDATE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsUpdate"
              + "SQS_USER_LIST_IMPORT_URL"  = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImport"
                # (3 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.user_list_events_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "user_list_events_sqs_processor" {
        id                             = "UserListSearch-Prod-EventHandler"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-EventHandler:92" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-EventHandler:92/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "92" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "BACKFILL"                  = "false" -> null
              + "SQS_USER_ITEMS_DELETE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsDelete"
              + "SQS_USER_ITEMS_UPDATE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsUpdate"
              + "SQS_USER_LIST_IMPORT_URL"  = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImport"
                # (3 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.user_list_import_backfill_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "user_list_import_backfill_sqs_processor" {
        id                             = "UserListSearch-Prod-UserListImportBackfill"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UserListImportBackfill:311" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UserListImportBackfill:311/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "311" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "SQS_USER_ITEMS_DELETE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsDelete"
              + "SQS_USER_ITEMS_UPDATE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsUpdate"
              + "SQS_USER_LIST_IMPORT_URL"  = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImport"
                # (4 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.user_list_import_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "user_list_import_sqs_processor" {
        id                             = "UserListSearch-Prod-UserListImport"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UserListImport:309" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UserListImport:309/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "309" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "BACKFILL"                  = "false" -> null
              + "SQS_USER_ITEMS_DELETE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsDelete"
              + "SQS_USER_ITEMS_UPDATE_URL" = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserItemsUpdate"
              + "SQS_USER_LIST_IMPORT_URL"  = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListImport"
                # (3 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # local_file.appspec will be created
  + resource "local_file" "appspec" {
      + content              = jsonencode(
            {
              + Resources = [
                  + {
                      + TargetService = {
                          + Properties = {
                              + LoadBalancerInfo = {
                                  + ContainerName = "node"
                                  + ContainerPort = 4000
                                }
                              + TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/UserListSearch-Prod-Apollo:373"
                            }
                          + Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              + version   = 1
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 7 to change, 0 to destroy.
local_file.appspec: Creating...
local_file.appspec: Creation complete after 0s [id=ee04b4dfee43272d07c57b60e0778d56b876c41a]
aws_lambda_function.user_list_import_backfill_sqs_processor: Modifying... [id=UserListSearch-Prod-UserListImportBackfill]
aws_lambda_function.user_list_import_sqs_processor: Modifying... [id=UserListSearch-Prod-UserListImport]
aws_lambda_function.unified_events_consumer: Modifying... [id=UserListSearch-Prod-UnifiedEventsConsumer]
aws_lambda_function.item_delete_sqs_processor: Modifying... [id=UserListSearch-Prod-ItemDelete]
aws_lambda_function.item_update_sqs_processor: Modifying... [id=UserListSearch-Prod-ItemUpdate]
aws_lambda_function.item_update_backfill_sqs_processor: Modifying... [id=UserListSearch-Prod-ItemUpdateBackfill]
aws_lambda_function.user_list_events_sqs_processor: Modifying... [id=UserListSearch-Prod-EventHandler]
aws_lambda_function.item_update_backfill_sqs_processor: Modifications complete after 6s [id=UserListSearch-Prod-ItemUpdateBackfill]
aws_lambda_function.user_list_import_sqs_processor: Modifications complete after 6s [id=UserListSearch-Prod-UserListImport]
aws_lambda_function.user_list_events_sqs_processor: Modifications complete after 6s [id=UserListSearch-Prod-EventHandler]
aws_lambda_function.user_list_import_backfill_sqs_processor: Modifications complete after 6s [id=UserListSearch-Prod-UserListImportBackfill]
aws_lambda_function.item_update_sqs_processor: Modifications complete after 7s [id=UserListSearch-Prod-ItemUpdate]
aws_lambda_function.item_delete_sqs_processor: Modifications complete after 7s [id=UserListSearch-Prod-ItemDelete]
aws_lambda_function.unified_events_consumer: Modifications complete after 7s [id=UserListSearch-Prod-UnifiedEventsConsumer]

Apply complete! Resources: 1 added, 7 changed, 0 destroyed.

Outputs:

workspace = "UserListSearch-Prod"

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"0e626419-68e3-4c83-a771-e14c1ccd2f4c","JobName":"user-list-search_infrastructure_apply_prod","PRNumber":222,"Program":"tfcmt","SHA1":"204e2346c2dfd9912e712b29f2afc1b9bf4602bc","Target":"user-list-search-cdk","Vars":{}} -->